Data/TestFiles/cases/PeriodicBoundaryAndMeanVelocityForce/case/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    constraint
    {
        type        symmetry;
        value       $internalField;
    }

    constraint001_master
    {
        type        cyclicAMI;
    }

    constraint001_slave
    {
        type        cyclicAMI;
    }



    wall
    {
        type        nutkWallFunction;
        value       uniform 0;
    }

    defaultFaces
    {
        type        zeroGradient;
    }

}

// ************************************************************************* //
